testFiles/results_one_thread_6GB_bench/memtier_oomd_yes_freeze.out
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  40 secs]  0 threads:       47775 ops,    1149 (avg:    1189) ops/sec, 1.02GB/sec (avg: 865.96MB/sec), 425.35 (avg: 420.81) msec latency

1         Threads
50        Connections per thread
40        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          108.02          ---          ---       435.14901       423.93500       606.20700       647.16700    884870.20 
Gets         1077.94         0.00      1077.94       419.37987       440.31900       638.97500       729.08700        42.01 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       1185.96         0.00      1077.94       420.81502       438.27100       638.97500       729.08700    884912.21 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET     145.407        0.000
SET     350.207        5.000
SET     368.639       10.000
SET     378.879       15.000
SET     385.023       20.000
SET     391.167       25.000
SET     397.311       30.000
SET     403.455       35.000
SET     409.599       40.000
SET     417.791       45.000
SET     423.935       50.000
SET     428.031       52.500
SET     430.079       55.000
SET     436.223       57.500
SET     440.319       60.000
SET     444.415       62.500
SET     450.559       65.000
SET     456.703       67.500
SET     464.895       70.000
SET     471.039       72.500
SET     479.231       75.000
SET     483.327       76.250
SET     485.375       77.500
SET     489.471       78.750
SET     493.567       80.000
SET     497.663       81.250
SET     501.759       82.500
SET     505.855       83.750
SET     509.951       85.000
SET     514.047       86.250
SET     518.143       87.500
SET     520.191       88.125
SET     522.239       88.750
SET     528.383       89.375
SET     528.383       90.000
SET     532.479       90.625
SET     536.575       91.250
SET     536.575       91.875
SET     540.671       92.500
SET     544.767       93.125
SET     548.863       93.750
SET     552.959       94.062
SET     552.959       94.375
SET     557.055       94.688
SET     561.151       95.000
SET     561.151       95.312
SET     565.247       95.625
SET     569.343       95.938
SET     573.439       96.250
SET     573.439       96.562
SET     577.535       96.875
SET     581.631       97.031
SET     581.631       97.188
SET     585.727       97.344
SET     585.727       97.500
SET     585.727       97.656
SET     589.823       97.812
SET     589.823       97.969
SET     593.919       98.125
SET     598.015       98.281
SET     598.015       98.438
SET     598.015       98.516
SET     602.111       98.594
SET     602.111       98.672
SET     602.111       98.750
SET     606.207       98.828
SET     606.207       98.906
SET     606.207       98.984
SET     610.303       99.062
SET     610.303       99.141
SET     614.399       99.219
SET     614.399       99.258
SET     618.495       99.297
SET     618.495       99.336
SET     618.495       99.375
SET     618.495       99.414
SET     622.591       99.453
SET     622.591       99.492
SET     622.591       99.531
SET     626.687       99.570
SET     626.687       99.609
SET     626.687       99.629
SET     626.687       99.648
SET     626.687       99.668
SET     626.687       99.688
SET     630.783       99.707
SET     630.783       99.727
SET     630.783       99.746
SET     634.879       99.766
SET     634.879       99.785
SET     638.975       99.805
SET     638.975       99.814
SET     638.975       99.824
SET     638.975       99.834
SET     643.071       99.844
SET     643.071       99.854
SET     647.167       99.863
SET     647.167       99.873
SET     647.167       99.883
SET     647.167       99.893
SET     647.167       99.902
SET     647.167       99.907
SET     651.263       99.912
SET     651.263       99.917
SET     651.263       99.922
SET     651.263       99.927
SET     655.359       99.932
SET     655.359       99.937
SET     655.359       99.941
SET     655.359       99.946
SET     655.359       99.951
SET     655.359       99.954
SET     655.359       99.956
SET     655.359       99.958
SET     655.359       99.961
SET     655.359       99.963
SET     655.359       99.966
SET     655.359       99.968
SET     655.359       99.971
SET     655.359       99.973
SET     655.359       99.976
SET     655.359       99.977
SET     663.551       99.978
SET     663.551      100.000
---
GET       0.303        0.000
GET      55.807        5.000
GET     153.599       10.000
GET     368.639       15.000
GET     389.119       20.000
GET     399.359       25.000
GET     409.599       30.000
GET     415.743       35.000
GET     423.935       40.000
GET     430.079       45.000
GET     440.319       50.000
GET     444.415       52.500
GET     448.511       55.000
GET     452.607       57.500
GET     458.751       60.000
GET     464.895       62.500
GET     471.039       65.000
GET     477.183       67.500
GET     483.327       70.000
GET     489.471       72.500
GET     497.663       75.000
GET     501.759       76.250
GET     505.855       77.500
GET     509.951       78.750
GET     514.047       80.000
GET     518.143       81.250
GET     524.287       82.500
GET     528.383       83.750
GET     536.575       85.000
GET     540.671       86.250
GET     544.767       87.500
GET     548.863       88.125
GET     548.863       88.750
GET     552.959       89.375
GET     557.055       90.000
GET     561.151       90.625
GET     561.151       91.250
GET     565.247       91.875
GET     569.343       92.500
GET     573.439       93.125
GET     577.535       93.750
GET     577.535       94.062
GET     581.631       94.375
GET     585.727       94.688
GET     585.727       95.000
GET     589.823       95.312
GET     593.919       95.625
GET     593.919       95.938
GET     598.015       96.250
GET     602.111       96.562
GET     606.207       96.875
GET     606.207       97.031
GET     610.303       97.188
GET     610.303       97.344
GET     614.399       97.500
GET     618.495       97.656
GET     618.495       97.812
GET     622.591       97.969
GET     622.591       98.125
GET     626.687       98.281
GET     626.687       98.438
GET     626.687       98.516
GET     630.783       98.594
GET     630.783       98.672
GET     630.783       98.750
GET     634.879       98.828
GET     638.975       98.906
GET     638.975       98.984
GET     643.071       99.062
GET     643.071       99.141
GET     647.167       99.219
GET     647.167       99.258
GET     651.263       99.297
GET     651.263       99.336
GET     655.359       99.375
GET     655.359       99.414
GET     655.359       99.453
GET     663.551       99.492
GET     663.551       99.531
GET     671.743       99.570
GET     675.839       99.609
GET     679.935       99.629
GET     684.031       99.648
GET     688.127       99.668
GET     688.127       99.688
GET     696.319       99.707
GET     696.319       99.727
GET     700.415       99.746
GET     704.511       99.766
GET     708.607       99.785
GET     712.703       99.805
GET     712.703       99.814
GET     712.703       99.824
GET     720.895       99.834
GET     720.895       99.844
GET     720.895       99.854
GET     720.895       99.863
GET     724.991       99.873
GET     724.991       99.883
GET     729.087       99.893
GET     729.087       99.902
GET     729.087       99.907
GET     733.183       99.912
GET     733.183       99.917
GET     733.183       99.922
GET     741.375       99.927
GET     741.375       99.932
GET     741.375       99.937
GET     741.375       99.941
GET     745.471       99.946
GET     745.471       99.951
GET     745.471       99.954
GET     745.471       99.956
GET     745.471       99.958
GET     745.471       99.961
GET     753.663       99.963
GET     753.663       99.966
GET     753.663       99.968
GET     753.663       99.971
GET     753.663       99.973
GET     753.663       99.976
GET     753.663       99.977
GET     753.663       99.978
GET     753.663       99.979
GET     753.663       99.980
GET     757.759       99.982
GET     757.759      100.000
---
WAIT      0.000      100.000